nvitya/vihal/rv32i/GD32V/src/vectors_c_gd32v.cpp
// vector.cpp

#include "platform.h"

extern "C"
{

void Default_Handler(void);

/* Peripherals handlers */
void IRQ_Handler_00       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_01       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_02       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_03       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_04       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_05       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_06       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_07       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_08       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_09       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_10       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_11       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_12       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_13       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_14       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_15       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_16       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_17       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_18       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_19       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_20       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_21       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_22       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_23       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_24       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_25       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_26       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_27       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_28       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_29       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_30       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_31       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_32       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_33       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_34       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_35       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_36       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_37       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_38       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_39       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_40       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_41       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_42       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_43       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_44       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_45       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_46       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_47       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_48       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_49       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_50       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_51       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_52       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_53       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_54       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_55       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_56       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_57       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_58       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_59       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_60       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_61       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_62       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_63       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_64       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_65       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_66       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_67       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_68       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_69       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_70       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_71       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_72       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_73       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_74       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_75       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_76       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_77       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_78       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_79       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_80       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_81       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_82       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_83       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_84       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_85       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_86       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_87       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_88       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_89       ( void ) __attribute__ ((weak, alias("Default_Handler")));

void IRQ_Handler_90       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_91       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_92       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_93       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_94       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_95       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_96       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_97       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_98       ( void ) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler_99       ( void ) __attribute__ ((weak, alias("Default_Handler")));


typedef void (* pHandler)(void);

extern const pHandler __isr_vectors[];

// must be 512 aligned otherwise does not work !
__attribute__((aligned(512),used))
const pHandler __isr_vectors[] =
{
  (pHandler) IRQ_Handler_00,  // 0
  (pHandler) IRQ_Handler_01,  // 0
  (pHandler) IRQ_Handler_02,  // 0
  (pHandler) IRQ_Handler_03,  // eclic_msip_handler
  (pHandler) IRQ_Handler_04,  // 0
  (pHandler) IRQ_Handler_05,  // 0
  (pHandler) IRQ_Handler_06,  // 0
  (pHandler) IRQ_Handler_07,  // eclic_mtip_handler  (MTIMER)
  (pHandler) IRQ_Handler_08,  // 0
  (pHandler) IRQ_Handler_09,  // 0
  (pHandler) IRQ_Handler_10,  // 0
  (pHandler) IRQ_Handler_11,  // 0
  (pHandler) IRQ_Handler_12,  // 0
  (pHandler) IRQ_Handler_13,  // 0
  (pHandler) IRQ_Handler_14,  // 0
  (pHandler) IRQ_Handler_15,  // 0
  (pHandler) IRQ_Handler_16,  // 0
  (pHandler) IRQ_Handler_17,  // eclic_bwei_handler
  (pHandler) IRQ_Handler_18,  // eclic_pmovi_handler
  (pHandler) IRQ_Handler_19,  // WWDGT_IRQHandler
  (pHandler) IRQ_Handler_20,  // LVD_IRQHandler
  (pHandler) IRQ_Handler_21,  // TAMPER_IRQHandler
  (pHandler) IRQ_Handler_22,  // RTC_IRQHandler
  (pHandler) IRQ_Handler_23,  // FMC_IRQHandler
  (pHandler) IRQ_Handler_24,  // RCU_IRQHandler
  (pHandler) IRQ_Handler_25,  // EXTI0_IRQHandler
  (pHandler) IRQ_Handler_26,  // EXTI1_IRQHandler
  (pHandler) IRQ_Handler_27,  // EXTI2_IRQHandler
  (pHandler) IRQ_Handler_28,  // EXTI3_IRQHandler
  (pHandler) IRQ_Handler_29,  // EXTI4_IRQHandler
  (pHandler) IRQ_Handler_30,  // DMA0_Channel0_IRQHandler
  (pHandler) IRQ_Handler_31,  // DMA0_Channel1_IRQHandler
  (pHandler) IRQ_Handler_32,  // DMA0_Channel2_IRQHandler
  (pHandler) IRQ_Handler_33,  // DMA0_Channel3_IRQHandler
  (pHandler) IRQ_Handler_34,  // DMA0_Channel4_IRQHandler
  (pHandler) IRQ_Handler_35,  // DMA0_Channel5_IRQHandler
  (pHandler) IRQ_Handler_36,  // DMA0_Channel6_IRQHandler
  (pHandler) IRQ_Handler_37,  // ADC0_1_IRQHandler
  (pHandler) IRQ_Handler_38,  // CAN0_TX_IRQHandler
  (pHandler) IRQ_Handler_39,  // CAN0_RX0_IRQHandler
  (pHandler) IRQ_Handler_40,  // CAN0_RX1_IRQHandler
  (pHandler) IRQ_Handler_41,  // CAN0_EWMC_IRQHandler
  (pHandler) IRQ_Handler_42,  // EXTI5_9_IRQHandler
  (pHandler) IRQ_Handler_43,  // TIMER0_BRK_IRQHandler
  (pHandler) IRQ_Handler_44,  // TIMER0_UP_IRQHandler
  (pHandler) IRQ_Handler_45,  // TIMER0_TRG_CMT_IRQHandler
  (pHandler) IRQ_Handler_46,  // TIMER0_Channel_IRQHandler
  (pHandler) IRQ_Handler_47,  // TIMER1_IRQHandler
  (pHandler) IRQ_Handler_48,  // TIMER2_IRQHandler
  (pHandler) IRQ_Handler_49,  // TIMER3_IRQHandler
  (pHandler) IRQ_Handler_50,  // I2C0_EV_IRQHandler
  (pHandler) IRQ_Handler_51,  // I2C0_ER_IRQHandler
  (pHandler) IRQ_Handler_52,  // I2C1_EV_IRQHandler
  (pHandler) IRQ_Handler_53,  // I2C1_ER_IRQHandler
  (pHandler) IRQ_Handler_54,  // SPI0_IRQHandler
  (pHandler) IRQ_Handler_55,  // SPI1_IRQHandler
  (pHandler) IRQ_Handler_56,  // USART0_IRQHandler
  (pHandler) IRQ_Handler_57,  // USART1_IRQHandler
  (pHandler) IRQ_Handler_58,  // USART2_IRQHandler
  (pHandler) IRQ_Handler_59,  // EXTI10_15_IRQHandler
  (pHandler) IRQ_Handler_60,  // RTC_Alarm_IRQHandler
  (pHandler) IRQ_Handler_61,  // USBFS_WKUP_IRQHandler
  (pHandler) IRQ_Handler_62,  // 0
  (pHandler) IRQ_Handler_63,  // 0
  (pHandler) IRQ_Handler_64,  // 0
  (pHandler) IRQ_Handler_65,  // 0
  (pHandler) IRQ_Handler_66,  // 0
  (pHandler) IRQ_Handler_67,  // EXMC_IRQHandler
  (pHandler) IRQ_Handler_68,  // 0
  (pHandler) IRQ_Handler_69,  // TIMER4_IRQHandler
  (pHandler) IRQ_Handler_70,  // SPI2_IRQHandler
  (pHandler) IRQ_Handler_71,  // UART3_IRQHandler
  (pHandler) IRQ_Handler_72,  // UART4_IRQHandler
  (pHandler) IRQ_Handler_73,  // TIMER5_IRQHandler
  (pHandler) IRQ_Handler_74,  // TIMER6_IRQHandler
  (pHandler) IRQ_Handler_75,  // DMA1_Channel0_IRQHandler
  (pHandler) IRQ_Handler_76,  // DMA1_Channel1_IRQHandler
  (pHandler) IRQ_Handler_77,  // DMA1_Channel2_IRQHandler
  (pHandler) IRQ_Handler_78,  // DMA1_Channel3_IRQHandler
  (pHandler) IRQ_Handler_79,  // DMA1_Channel4_IRQHandler
  (pHandler) IRQ_Handler_80,  // 0
  (pHandler) IRQ_Handler_81,  // 0
  (pHandler) IRQ_Handler_82,  // CAN1_TX_IRQHandler
  (pHandler) IRQ_Handler_83,  // CAN1_RX0_IRQHandler
  (pHandler) IRQ_Handler_84,  // CAN1_RX1_IRQHandler
  (pHandler) IRQ_Handler_85,  // CAN1_EWMC_IRQHandler
  (pHandler) IRQ_Handler_86   // USBFS_IRQHandler
};

// Processor ends up here if an unexpected interrupt occurs or a
// specific handler is not present in the application code.
// When in DEBUG, trigger a debug exception to clearly notify
// the user of the exception and help identify the cause.

void __attribute__ ((section(".after_vectors"),weak,interrupt))
Default_Handler(void)
{
#if 0 // todo: detect if the debugger is connected
  if (CoreDebug->DHCSR & 1)
#endif
  {
    asm("ebreak");
  }

  while (1)
  {
    asm("nop");
  }

  asm("mret");
}

__attribute__ ((section(".after_vectors"),weak))
void Trap_Handler(unsigned acause, unsigned asp)
{
#if 0 // todo: detect if the debugger is connected
  if (CoreDebug->DHCSR & 1)
#endif
  {
    asm("ebreak");
  }

  while (1)
  {
    asm("nop");
  }
}

} // extern "C"
